events/Data Storage Events/Metadata.identity/ALERT.Metadata.IdentityUpdate.Stored.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2">
    <s:Header/>
    <s:Body>
        <wsnt:Notify>
            <wsnt:NotificationMessage>
                <wsnt:Topic/>
                <wsnt:ProducerReference>
                    <wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
                </wsnt:ProducerReference>
                <wsnt:Message>
                    <ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:sm="http://www.alert-project.eu/stardom" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
                        <ns1:head>
                            <ns1:sender>METADATASERVICE</ns1:sender>
                            <ns1:timestamp>10003</ns1:timestamp>
                            <ns1:sequencenumber>1</ns1:sequencenumber>
                        </ns1:head>
                        <ns1:payload>
                            <ns1:meta>
                                <ns1:startTime>10010</ns1:startTime>
                                <ns1:endTime>10020</ns1:endTime>
                                <ns1:eventName>ALERT.Metadata.IdentityUpdate.Stored</ns1:eventName>
                                <ns1:eventId>5748</ns1:eventId>
                                <ns1:eventType>reply</ns1:eventType>
                            </ns1:meta>
                            <ns1:eventData>
                                <sm:identities>
                                    <sm:identity>
                                        <sm:uuid>51d8ecec1d6ea40106c6c71ffed13547010870b0ab57fe396f5fbb124967e0eb</sm:uuid>
                                        <sm:add>
                                            <sm:is>
                                                <sm:person>
                                                    <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person4</sm:uri>
                                                    <sm:id>fotis@gmail.com</sm:id>
                                                    <sm:firstname>Fotis</sm:firstname>
                                                    <sm:lastname>Paraskevopoulos</sm:lastname>
                                                    <sm:email>fotis@gmail.com</sm:email>
                                                    <sm:username>fotakis</sm:username>
                                                </sm:person>
                                                <sm:person>
                                                    <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person5</sm:uri>
                                                </sm:person>
                                            </sm:is>
                                            <sm:isnt>
                                                <sm:person>
                                                    <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person6</sm:uri>
                                                </sm:person>
                                            </sm:isnt>
                                        </sm:add>
                                        <sm:remove>
                                            <sm:is>
                                                <sm:person>
                                                    <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1</sm:uri>
                                                </sm:person>
                                                <sm:person>
                                                    <sm:uri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</sm:uri>
                                                </sm:person>
                                            </sm:is>
                                            <sm:isnt>
                                                <!-- This node means all the linked person instances -->
                                                <sm:allPerson/>
                                            </sm:isnt>
                                        </sm:remove>
                                    </sm:identity>
                                </sm:identities>
                                <o:identities>
                                    <o:identity>
                                        <o:identityUri>http://www.alert-project.eu/ontologies/alert.owl#Identity1</o:identityUri>
                                        <o:addPersonIsUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person4</o:addPersonIsUri>
                                        <o:addPersonIsUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person5</o:addPersonIsUri>
                                        <o:removePersonIsUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person1</o:removePersonIsUri>
                                        <o:removePersonIsUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person2</o:removePersonIsUri>
                                        <o:addPersonIsntUri>http://www.alert-project.eu/ontologies/alert_scm.owl#Person6</o:addPersonIsntUri>
                                    </o:identity>
                                </o:identities>
                            </ns1:eventData>
                        </ns1:payload>
                    </ns1:event>
                </wsnt:Message>
            </wsnt:NotificationMessage>
        </wsnt:Notify>
    </s:Body>
</s:Envelope>
